{
  "projects": [
    {
      "name": "New Economy Coalition",
      "alt": "The New Economy Coalition Member Directory.",
      "src": "public/projects/nec.png",
      "title": "Working with the New Economy Coalition (NEC) on updating their website, they requested a new member directory that will automatically pull updates from their database to populate a map, complete with search and filter features. I created a middleware API that can securely fetch member data from their database."
    }, {
      "name": "Gray Area",
      "alt": "The Gray Area Festival 2025 website.",
      "src": "public/projects/grayarea.png",
      "title": "The Gray Area is a long-standing non-profit arts organization in the Bay Area. In the theme for its 2025 festival, I worked with a designer on creating an interactive, body-invoking website that plays around with the concept of a fun user interface with basic php and javascript."
    }, {
      "name": "Healing Justice Lineages",
      "alt": "The Healing Justice Lineages website homepage.",
      "src": "public/projects/hjl.png",
      "title": "The Healing Justice Lineages (HJL) website is a digital archival of collective care and safety strategies, to continue the work of authors Cara Page & Erica Woodland."
    }, {
      "name": "soft network",
      "alt": "A pink, orange, and dark purple net cascades from the ceiling, obscuring two people hugging nodes inside the net, one person is holding a phone, and the other person is smiling.",
      "src": "public/projects/touched.jpg",
      "title": "The soft networks is a net made of nodes that communicate to each other by touches--when one person hugs a node, a message is sent to all the other nodes which can be felt by another person.\nEach node consists of recycled burlap and fleece yarn, a small board with a Raspberry Pi Zero, which starts a server and listens for messages, and also controls 2 mini haptic motors."
    }, {
      "name": "text-me-smth-nice",
      "alt": "Phone receiving texts from the text-me-smth-nice app.",
      "src": "public/projects/text-me-smth-nice.gif",
      "title": "A messaging app that uses the Twilio SMS API to send out nice texts periodically."
    }, {
      "name": "handhold mouse",
      "alt": "A table display with the handhold mouse, on top of a light blue mousepad, connected to a iMac G4 computer--people to play with an old drawing program called Kid Pix (2000) on the iMac.",
      "src": "public/projects/handhold.png",
      "title": "The handhold mouse--connected to a iMac G4 computer, inviting people to play with an old drawing program called Kid Pix (2000) on the iMac. This was a project created in collaboration with <a title='link to Kat' href='https://k--k.net/'>Kat Kitay</a>."
    }, {
      "name": "EEG",
      "alt": "Two kids with black EEG headsets on stand in front of 2 pairs of EEG lights suspended from the ceiling--the pair of lights on the left shine green, and the two on the right shine orange.",
      "src": "public/projects/eeg.png",
      "title": "Twins using the EEG devices, and controlling different sets of the lights in the EEG cloud, based on activity levels in their brain. This project was created in collaboration with <a title='link to Daniel' href='https://danielwai.myportfolio.com'>Daniel Wai</a>, and with a lot of advice on EEG devices, as well as how to read its data from <a title='link to Jason' href='https://jasonjsnell.com'>Jason Snell."
    }, {
      "name": "ai-loves-horror",
      "alt": "An old tv set with a green screen surround by piles of books sitting atop a lace-covered desk.",
      "src": "public/projects/ai-loves-horror.png",
      "title": "A <a title='link to project on GitHub' href='https://iguannalin.github.io/ai-loves-horror/about.html'>horror text-based adventure game</a> made using OpenAI's GPT-3 (Davinci model) API. This project was shown during the ITP Winter Show, 2022."
    }
  ]
}